---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeEntryFailures.CircularParentage
source: html/9096a31d-5445-c1a0-9f82-2afc1fab7eeb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeEntryFailures.CircularParentage Property

A sub-[EntryType] '[Code]' specified as parent for its current ancestor '[Code]'

## Syntax (C#)
```csharp
public static FailureDefinitionId CircularParentage { get; }
```